 [
  {
  "entityId":"1222893113",
  "companyName":"Summit Preservation, LLC",
  "ratingCount":"7",
  "compositeRating":"5.0",
  "companyOverview":"Summit Preservation prides itself on creating beautiful surfaces for your home. You can always expect a great experience with us, a reasonable rate and a quality finish to the job. Call us today!",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(330) 555-3136",
  "latitude":39.8873,
  "longitude":-104.8805,
  "servicesOffered":"Flooring & Carpet, Tile",
  "specialty":"Additions & Remodeling",
  "primaryLocation":"Henderson, CO",
  "email":"contact@summitpresllc.biz"
  },
  {
  "entityId":"1351000593",
  "companyName":"Weekend Warrior Home Services",
  "ratingCount":"3",
  "compositeRating":"3.94",
  "companyOverview":"Weekend Warrior Home Services looks forward to helping you with all of your home improvement needs. We have over 40 years of experience in the construction industry. We are committed to providing quality service and believe in giving our customers the finished product that they desire. Let Weekend Warrior Home Services help make your home a place of comfort and tranquility. Please give us a call today!",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(303) 555-2866",
  "latitude":39.6885,
  "longitude":-105.1576,
  "servicesOffered":"Additions & Remodeling, Appliances, Brick & Stone, Cabinets, Carpenters, Countertops, Decks, Drywall  & Plaster, Flooring & Carpet, Painting, Tile",
  "specialty":"Additions & Remodeling",
  "primaryLocation":"Lakewood, CO",
  "email":"contact@wwhs.biz"
  },
  {
  "entityId":"1437997085",
  "companyName":"S.K. Concepts, LLC",
  "ratingCount":"0",
  "compositeRating":"0.0",
  "companyOverview":"At SK Concepts, we take great pride in our experience, expertise, quality and customer service that we provide to meet the consumers' needs. It is our mission to provide excellent workmanship and complete customer satisfaction from start to completion of a project. In order to understand the needs and expectations of our customers, we take great care to work and communicate with every customer in a professional manner. Our reputation is based on service, safety and quality, regardless of how large or small the job.",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(303) 555-5398",
  "latitude":39.7164,
  "longitude":-105.2437,
  "servicesOffered":"Additions & Remodeling, Carpenters, Decks, Sheds & Enclosures",
  "specialty":"Additions & Remodeling",
  "primaryLocation":"Golden, CO",
  "email":"contact@sskconcepts.biz"
  },
  {
  "entityId":"2412488969",
  "companyName":"Through The Fog Remodeling",
  "ratingCount":"1",
  "compositeRating":"5.0",
  "companyOverview":"Through The Fog Remodeling is the premier professional company offering residential services to our clients in the Golden area.  We are known to pay exquisite attention to detail while making your satisfaction our number one priority.\r\n\r\nPlease call us today to schedule your appointment with Colorado's true professionals at work for you!\r\n",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(720) 555-6119",
  "latitude":39.7164,
  "longitude":-105.2437,
  "servicesOffered":"Additions & Remodeling",
  "specialty":"Additions & Remodeling",
  "primaryLocation":"Golden, CO",
  "email":"contact@throughthefog.biz"
  },
  {
  "entityId":"5645301920",
  "companyName":"GATworks, LLC",
  "ratingCount":"15",
  "compositeRating":"4.79",
  "companyOverview":"We're a locally owned and operated company with almost 30 years of industry experience. We value honesty and integrity in all aspects of our business. We offer a variety of home improvement services that are customizable to each individual project. We specialize in handyman/carpentry and painting work and a variety of related services and repair projects. We pride ourselves on the quality of our work as well as our commitment to outstanding results. We look forward to building lasting relationships with our clients and guarantee your satisfaction!",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(303) 555-5559",
  "latitude":39.7164,
  "longitude":-105.2437,
  "servicesOffered":"Additions & Remodeling, Cabinets, Carpenters, Ceilings, Decks, Doors, Drywall  & Plaster, Fences, Garage & Garage Doors, Glass & Mirrors, Handyman Services, Organizers, Painting, Power Washing, Sheds & Enclosures, Siding, Window Coverings, Windows",
  "specialty":"Additions & Remodeling",
  "primaryLocation":"Golden, CO",
  "email":"contact@gatworksllc.biz"
  },
  {
  "entityId":"6452154715",
  "companyName":"Winshine Window Washing, LLC",
  "ratingCount":"2",
  "compositeRating":"3.0",
  "companyOverview":"The mission of Winshine Window Washing is to be the best and most admired window washing company in Northern Colorado.  Winshine Window Washing, LLC, provides fast and courteous window washing service with a personal touch.  We are always eager to answer your questions and concerns and have built our reputation on our commitment to providing quality service, which has earned us an impressive reputation with many valuable customers. We take pride in delivering value through top quality, dependable work, excellent pricing and reliable, honest service.  Please call us today for you next window washing estimate...and let the light shine in.",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(970) 555-0692",
  "latitude":40.4433,
  "longitude":-105.1046,
  "servicesOffered":"Cleaning & Maid Services",
  "specialty":"Cleaning & Maid Services",
  "primaryLocation":"Loveland, CO",
  "email":"contact@winwinwash.biz"
  },
  {
  "entityId":"8925290810",
  "companyName":"Local-Air",
  "ratingCount":"79",
  "compositeRating":"3.78",
  "companyOverview":"At Local-Air we pride ourselves in exceeding customers and clients expectations. We take the time to really listen and understand the desires of our customers and clients, to make sure you are fully satisfied with the job.  It is a true job well done.",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(970) 555-6274",
  "latitude":40.2947,
  "longitude":-105.104,
  "servicesOffered":"Appliances, Cleaning & Maid Services, Garage & Garage Doors, Heating & Furnace Systems, Plumbing",
  "specialty":"Cleaning & Maid Services",
  "primaryLocation":"Berthoud, CO",
  "email":"contact@local-air.biz"
  },
  {
  "entityId":"2249746472",
  "companyName":"Denver Ducts Corp.",
  "ratingCount":"43",
  "compositeRating":"2.53",
  "companyOverview":"Here at Denver Duct Corp., we pride ourselves on the highest levels of professionalism and efficiency.  Each spring and fall you should take time to make sure that all of your vents are ready for the vigor of the coming season.  \nWe live in a world where healthy living has become a way of life. We diet and exercise to make ourselves feel better. We have also taken on environmental  issues to make our world a cleaner and safer place to live. Yet the most overlooked issue is the air that we breathe.\nThe Environmental Protection Agency claims that indoor air has been found to be more polluted then outdoor air. Now consider on average people spend 90% of their time indoors... The fact can be quite alarming. Considering that we spend so much time indoors, it makes perfect sense to clean the source of our indoor air quality problems...Our Air Ducts..\n",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(888) 555-5445",
  "latitude":39.6224,
  "longitude":-104.7893,
  "servicesOffered":"Cleaning & Maid Services",
  "specialty":"Cleaning & Maid Services",
  "primaryLocation":"Aurora, CO",
  "email":"contact@denverductcorps.biz"
  },
  {
  "entityId":"1722809125",
  "companyName":"Let There Be Light",
  "ratingCount":"25",
  "compositeRating":"4.85",
  "companyOverview":"Let There Be Light is a full service residential and commercial window and gutter cleaning service dedicated to quality. Dependable professional service always on time and on budget!  We take great pride in giving your home or business sparkling clean windows and gutters from mid-rise commercial buildings (4 to 5 Stories) to 2-3 story homes!",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(970) 555-1840",
  "latitude":40.5317,
  "longitude":-105.1415,
  "servicesOffered":"Cleaning & Maid Services, Power Washing",
  "specialty":"Cleaning & Maid Services",
  "primaryLocation":"Fort Collins, CO",
  "email":"contact@wlettherebelight.biz"
  },
  {
  "entityId":"9453405616",
  "companyName":"M & J Carpet and Air Duct Cleaning Service",
  "ratingCount":"1",
  "compositeRating":"4.67",
  "companyOverview":"M & J Carpet and Air Duct Cleaning Service comes to you with over 30 years of professional experience in the industry. A quality customer experience is our number one goal. Large to small we do it all. Customer satisfaction is guaranteed. ",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(970) 555-0510",
  "latitude":40.5065,
  "longitude":-105.0136,
  "servicesOffered":"Carpet & Upholstery Cleaning, Cleaning & Maid Services",
  "specialty":"Cleaning & Maid Services",
  "primaryLocation":"Fort Collins, CO",
  "email":"contact@mjcarpet.biz"
  },
  {
  "entityId":"5059743465",
  "companyName":"Pipecraft Plumbing, Inc.",
  "ratingCount":"4",
  "compositeRating":"2.0",
  "companyOverview":"Pipecraft Plumbing, Inc., provides outstanding plumbing services to Arvada and the Denver metro area. We are a small, family owned company and keep our overhead down. We pass that savings off to you, the customer! Calling the big names in the Plumbing business is going to guarantee a bigger plumbing bill. Whether you have a plumbing emergency involving burst pipes or you're ready to install a brand new water heater, our skilled technicians can get the job done quickly and efficiently, any time of day. In addition to our plumbing services, Pipecraft Plumbing, Inc., regularly provides Arvada and Denver area residents with gas leak detection and appliance installation services. Call us whenever you need help, and we'll send our experts out to your home or business and get you squared away. Call the Pipecraft Plumbing, Inc., office in Arvada today to speak with one of our certified plumbers and get your home in tiptop shape. We look forward to working with you!",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(303) 555-3829",
  "specialty":"Plumbing",
  "primaryLocation":"Arvada, CO",
  "email":"contact@pipecraft.biz"
  },
  {
  "entityId":"5475000890",
  "companyName":"Blea Mechanical Services",
  "ratingCount":"3",
  "compositeRating":"5.0",
  "companyOverview":"With several years experience, we work hard to bring each customer the best possible service and quality available. We look forward to working with you on your next project. We welcome your questions and thank you for your interest.",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(303) 555-3190",
  "specialty":"Plumbing",
  "primaryLocation":"Arvada, CO",
  "email":"contact@bleamech.biz"
  },
  {
  "entityId":"5803803218",
  "companyName":"The Worm Drain Cleaning",
  "ratingCount":"0",
  "compositeRating":"0.0",
  "companyOverview":"We have over 20 years of experience in the business. Here at The Worm Drain Cleaning, we pride our company on reliability, great communication, integrity, and quality work. We are experts in our trade, and will do our best to keep you as educated as we can on your particular task or project. We look forward to earning your business!",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(720) 555-7078",
  "specialty":"Plumbing",
  "primaryLocation":"Commerce City, CO",
  "email":"contact@theworm.biz"
  },
  {
  "entityId":"1266659753",
  "companyName":"AAA Service Plumbing, Inc.",
  "ratingCount":"179",
  "compositeRating":"4.59",
  "companyOverview":"$99 Drains Is the best choice for fast affordable drain service!  Do you need it cleared NOW!  Do you want a reasonable price!  We ensure superior service and expert craftsmanship on every call!!",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(303) 555-3333",
  "latitude":39.7953,
  "longitude":-105.1025,
  "servicesOffered":"Plumbing",
  "specialty":"Plumbing",
  "primaryLocation":"Arvada, CO",
  "email":"contact@aaa.biz"
  },
  {
  "entityId":"5366977300",
  "companyName":"Rocky Mountain Hot Jetting Services, Inc.",
  "ratingCount":"8",
  "compositeRating":"4.77",
  "companyOverview":"Fast, complete drain and sewer cleaning, when we leave your lines are COMPLETLY clean.  We offer a 1 year GUARANTEE, if it clogs again we come for free.  Because cabling/snaking a drain only removes a clog and Hot water jetting removes everything in your line, we know once we are done it is clean of all roots, grease, hair, anything in the line.  We have a camera that we use, and we encourage you to watch as we look at your line during the process.  We take great pride in our experience, expertise, quality and customer service that we provide to meet the consumer’s needs. It is our mission to provide excellent workmanship and complete customer satisfaction from start to completion of a project. In order to understand the needs and expectations of our customers, we take great care to work and communicate with every customer in a professional manner. Our reputation is based on service, safety and quality, regardless of how large or small the job.",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(720) 555-5347",
  "latitude":39.8271,
  "longitude":-105.064,
  "servicesOffered":"Plumbing, Power Washing",
  "specialty":"Plumbing",
  "primaryLocation":"Arvada, CO",
  "email":"contact@rockymtnhjs.biz"
  },
  {
  "entityId":"5790219775",
  "companyName":"Brookhaven Handyman",
  "ratingCount":"66",
  "compositeRating":"3.67",
  "companyOverview":"We value honesty and integrity in all aspects of our business. We look forward to building lasting relationships with our clients and guarantee your satisfaction!",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(678) 555-9893",
  "specialty":"Handyman Services",
  "primaryLocation":"Decatur, GA",
  "email":"contact@brookhaven.biz"
  },
  {
  "entityId":"4669847998",
  "companyName":"Nailed IT Construction Services",
  "ratingCount":"2",
  "compositeRating":"5.0",
  "companyOverview":"Welcome to Nailed IT Construction Services!  We are a full service handyman/home repair and maintenance company that proudly serves Atlanta.  Owner operator, Rudy Jones, takes great pride in his professionalism and the satisfaction of his customers. He has several years of experience, as well as an eye for detail, and completes every job to the satisfaction of his client!  For fast, reliable, and efficient service, give us a call today. You won't be disappointed!",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(404) 555-7037",
  "latitude":33.9325,
  "longitude":-84.3852,
  "servicesOffered":"Cabinets, Decks, Doors, Drywall  & Plaster, Handyman Services, Siding",
  "specialty":"Handyman Services",
  "primaryLocation":"Atlanta, GA",
  "email":"contact@nailedit.biz"
  },
  {
  "entityId":"2356150364",
  "companyName":"Fratellanza Landscaping and Land Care",
  "ratingCount":"4",
  "compositeRating":"4.83",
  "companyOverview":"At Fratellanza Landscaping and Land Care, we offer only the best in quality workmanship. We specialize in all phases of commercial and residential landscaping. We are committed to providing quality work and outstanding results and we are strongly involved in local community activities. Call us today!",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(470) 555-4023",
  "specialty":"Handyman Services",
  "primaryLocation":"Forest Park, GA",
  "email":"contact@fratellanzalandcare.biz"
  },
  {
  "entityId":"3338708244",
  "companyName":"Bright Painting, Inc.",
  "ratingCount":"11",
  "compositeRating":"4.97",
  "companyOverview":"A fresh coat of paint or stain can bring new life to rooms, add curb appeal to homes, and help protect your investment for years to come. We're happy to bid on all types of painting, staining and interior design projects in the Atlanta metro area. We will meet with you, at your convenience, and provide you with a free, written, detailed estimate. Locally owned and operated, we are a small company with big capabilities.",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(404) 555-0127",
  "latitude":33.8503,
  "longitude":-84.284,
  "servicesOffered":"Cabinets, Ceilings, Decks, Drywall  & Plaster, Flooring & Carpet, Handyman Services, Painting, Siding",
  "specialty":"Handyman Services",
  "primaryLocation":"Atlanta, GA",
  "email":"contact@brightpaint.biz"
  },
  {
  "entityId":"4541281426",
  "companyName":"Total Maintenance",
  "ratingCount":"10",
  "compositeRating":"4.28",
  "companyOverview":"Hello. I offer full service handyman projects, including washer , dryer and refrigerator repair. I will also do various handyman projects for residential and commercial settings.  Please call me for a free estimate. ",
  "canadianSP":false,
  "spanishSpeaking":false,
  "phoneNumber":"(404) 555-3302",
  "latitude":33.7062,
  "longitude":-84.5492,
  "servicesOffered":"Air Conditioning, Appliances, Drywall  & Plaster, Handyman Services, Plumbing",
  "specialty":"Handyman Services",
  "primaryLocation":"Atlanta, GA",
  "email":"contact@totalmaint.biz"
  }
  ]